Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Имеет следующую структуру:
en: It has the following structure:

source: Имеется возможность выполнения Циклов в несколько потоков, что может существенно сократить время обработки.
en: It is possible to execute the Loops in multiple threads that can considerably decrease the processing time.

source: Имеется возможность записи числа в компьютерном представлении экспоненциальной формы.
en: It is possible to record the numbers in the computer representation of the exponential form.

source: Имеется возможность использования сжатия данных различными алгоритмами.
en: It is possible to compress data using different algorithms.

source: Имеется возможность настройки преобразования набора данных в текстовый вид, определяя различные способы представления столбцов (с разделителями/фиксированной ширины), форматы типов данных, разделители и т.д.
en: It is possible to configure transformation of the data set to the text form defining different methods of representation of columns (with delimiters/fixed width), formats of data types, delimiters, etc.

source: Имеется возможность сглаживания рядов с пропущенными данными, при этом фильтр Ходрика-Прескотта подставляет вместо пропусков значения, которые обеспечивают максимальную гладкость в смысле функционала фильтра, а в случае Вейвлет-сглаживания пропуски предварительно интерполируются линейно.
en: It is possible to smooth the series with null data. In this case, the Hodrick-Prescott filter enables to insert the values that provide the maximum smoothness as far as the filter functionality is concerned instead of the null data. If Wavelet smoothing is used, the null data is linearly interpolated first.

source: Имеется несколько способов обработки совпадающих значений:
en: There are several methods to process matching values:

source: Имеется список переменных:
en: There is a list of variables:

source: Имеется три набора переменных:
en: There are three sets of variables:

source: Имеется три режима отбора, определяемые параметром "Положение приоритетного тестового множества":
en: There are three selection modes defined by "Priority test set position" parameter:

source: Имена
en: Names

source: Имена входных полей
en: Input fields names

source: Имена переменных можно использовать в Командной строке, т.е. поддерживается макроподстановка команд: %ИмяПеременной% — переменная, содержащая команду, которая подается на вход данного узла (см.
en: The variables names can be used in Command line, namely, macro replacement of commands is supported: %VariableName% means the variable that contains the command that is supplied to the input of this node (refer to

source: Имена полей.
en: Fields names.

source: Имена столбцов (полей) - в качестве заголовков столбцов будут использованы Имена полей.
en: Names of columns (fields): names of fields will be used as headers of columns.

source: Имена, задаваемые при выборе модификатора доступа, должны быть уникальны в рамках всего набора публикуемых пакетов.
en: The names set when selecting access modifier must be unique within the whole set of the published packages.

source: Имена, метки и значения переменных будут получены следующим образом:
en: Names, captions and values of fields will be received as follows:

source: Импорт
en: Import

source: Импорт в Loginom может осуществляться из множества источников, таких как текстовый файл, электронные таблицы, базы данных и другие.
en: Data is imported to Loginom from many sources, for example, a text file, spreadsheets, databases, etc.

source: Импорт данных является отправной точкой анализа данных.
en: Import is an important starting point of data analysis.

source: Импорт из Excel файла
en: Import from Excel File

source: Импорт из файла Sales.txt информации о продажах;
en: Import of the sales information from the Sales.txt file.

source: Импорт из хранилища данных
en: Import from Data Warehouse

source: Импортируемые поля
en: Imported Fields

source: Импортируемый текстовый файл должен удовлетворять следующим условиям:
en: The imported text file must meet the following requirements:

source: Имя
en: Name

source: Имя - имя поля, переменной или выражения
en: FieldName - name of field, variable or expression.

source: Имя входного поля
en: Input field name

source: Имя может быть <Не задано>, если настраиваемый порт единственный в списке входных или выходных.
en: The name can be <Unspecified> if there is only one configured port in the output or input list.

source: Имя не может начинаться с цифры.
en: It is not allowed to start the name from a digit.

source: Имя пакета
en: Package name

source: Имя пользователя.
en: Username.

source: Имя поля в допустимом формате.
en: Field name in the permissible format.

source: Имя поля основного источника данных, к которому относится внешнее разбиение.
en: Field name of the main data source to which the external binning relates.

source: Имя порта можно задать следующими способами:
en: The port name can be set in the following ways:

source: Имя применяется для указания переменной в выражениях калькулятора.
en: The name is used to specify the variable in the calculator expressions.

source: Имя столбца
en: Column name

source: Имя столбца для автонастройки
en: Column name for auto setup

source: Имя узла, который необходимо выполнить.
en: Name of the node to be executed.

source: Имя — уникальное в пределах одного набора переменных название, может состоять из заглавных или строчных латинских букв, символов подчеркивания и цифр.
en: The name must be unique in one set of variables. It can consist of the capital or lower case Latin letters, underscore characters and digits.

source: Имя;
en: Name

source: Имя_поля|Верхняя граница — верхняя граница доверительного интервала.
en: Field_name|Upper bound: the lower bound of the confidence interval.

source: Имя_поля|Нижняя граница — нижняя граница доверительного интервала.
en: Field_name|Lower bound: the lower bound of the confidence interval.

source: Имя_поля|Ошибка аппроксимации — остатки модели, отклонения между прогнозируемыми и фактическими значениями ряда.
en: Field_name|Error of approximation: model residuals, deviations between the forecast and actual series values.

source: Имя_поля|Прогноз — прогнозируемые значения исходного временного ряда.
en: Field_name|Forecast: forecast values of the source time series.

source: ИмяГруппы - имя группы, определяемой метасимволами (...);
en: GroupName - name of the group defined by metacharacters (...).

source: ИмяСтолбца - имя столбца, данные которого необходимо получить
en: ColumnName - return value column name.

source: Индекс заданного события.
en: Specified event index.

source: Инициализация объектов модуля происходит при первом таком вызове, при последующих используется кэш, в котором сохраняется состояние объектов модуля предыдущего вызова.
en: The module objects are initialised upon the first call. In the case of subsequent calls, cache is used. The module objects state of the previous call is preserved in it.

source: Иногда необходимо вручную задать последовательность выполнения узлов в Сценарии.
en: Sometimes the manual setting of the Workflow nodes execution order is required.

source: Иное название метрики F-мера. $$\displaystyle\mathsf{F_1=2⋅\frac{PPV⋅TPR}{PPV+TPR}=\frac{2TP}{2TP+FP+FN}}$$.
en: The metric is also called F measure. $$\displaystyle\mathsf{F_1=2⋅\frac{PPV⋅TPR}{PPV+TPR}=\frac{2TP}{2TP+FP+FN}}$$.

source: Интегральная функция гамма-распределения, равная (1 - односторонняя вероятность распределения хи-квадрат) с n степенями свободы.
en: Integral function of gamma distribution equal to (1 - one-sided probability of Chi-square distribution) with n degrees of freedom.

source: Интеграция и работа с веб-сервисами требует наличия следующих компонентов платформы Loginom:
en: The following Loginom platform components are required for the web services integration and operation:

source: Интеграция с внешними веб-сервисами
en: Integration with External Web Services

source: Интерактивное выполнение сценария
en: Interactive workflow execution

source: Интерактивный режим работы осуществляется в рабочем пространстве платформы (см.
en: The interactive mode of operation is used in the platform working space (refer to

source: Интервал совпадения
en: Match interval

source: Интервал — гиперболический тангенс.
en: Interval — hyperbolic tangent.

source: Интервалы рассчитываются следующим образом: от <Значение поля замена>-<Точность> до <Значение поля замена>+<Точность>.
en: Intervals are calculated as follows: from <Replace field value>-<Precision> to <Replace field value>+<Precision>.

source: Интерквартильный размах — критерием является расстояние между 1-м и 3-м квартилями распределения значений признака.
en: Interquartile range: the criterion is distance between the first and the third quartiles of indicator values distribution.

source: Интерфейс мастера предоставляет возможность осуществлять поиск узлов в дереве с помощью фильтров: по имени и комментарию узла.
en: The wizard interface enables to search for the nodes in the tree by means of filters, namely, by name and node comment.

source: Интерфейс мастера предоставляет возможность осуществлять поиск узлов в общем списке с помощью фильтров: по имени и комментарию узла.
en: The wizard interface enables to search for the nodes in the general list by means of filters, namely, by name and node comment.

source: Интерфейс представлен таблицей со следующими столбцами:
en: The interface is represented by a table with the following columns:

source: Интерфейс представления статистики
en: Statistics Representation Interface

source: Интерфейс представления формы
en: Form Representation Interface

source: Интерфейс табличного представления
en: Table Representation Interface

source: Информационный критерий Акаике скорректированный.
en: Akaike information criterion corrected.

source: Информационный критерий Акаике.
en: Akaike information criterion.

source: Информационный критерий Байеса.
en: Bayesian information criterion.

source: Информационный критерий Ханнана-Квина.
en: Hannan-Quinn information criterion.

source: Информационный критерий Акаике (AIC)
en: Akaike information criterion (AIC)

source: Информационный критерий Акаике скорректированный (AICc)
en: Akaike information criterion corrected (AICc)

source: Информационный критерий Байеса (BIC)
en: Bayesian information criterion (BIC)

source: Информационных индексов всех классов.
en: Information values of all classes.

source: Информацию о конечных точках, операциях, URL, структуре REST-запросов и ответов можно получить по ссылке:
en: See the link below to get information on endpoints, operations, URL, structure of REST requests and responses:

source: Информация о модели
en: Model Info

source: Иными словами, вычисляется корреляция между временным рядом и его копией, сдвинутой на один или несколько временных отсчетов.
en: In other words, correlation between time series and its copy shifted to one or several time lags is calculated.

source: Иными словами, предполагается, что данные в каждом кластере подчиняются определенному закону распределения, а именно, нормальному распределению.
en: In other words, it is assumed that the data in each cluster is subject to the particular distribution law, namely, probability distribution.

source: Исключение составляет корневой узел: для него минимальное количество экземпляров равно 0, если он является массивом, и 1 - если не является.
en: The only exception is the root node. The minimum number of its instances is equal to 0 if it is an array, and 1 if it is not an array.

source: Исключить можно с помощью переноса полей в список Доступные поля.
en: It is possible to exclude by means of fields transfer to the Available fields list.

source: Использование нормализации увеличивает качество и скорость обучения Нейросети.
en: Usage of normalization increases the quality and speed of the Neural Network training.

source: Использование LDAP аутентификации позволяет авторизоваться на сервере Loginom через LDAP сервер, если способ Аутентификации "Локальная", то Аутентификация происходит средствами Loginom.
en: Use of the LDAP authentication enables to log in to the Loginom server by means of the LDAP server. If the Authentification method is "Local", Authentification is performed by means of the Loginom tools.

source: Использование LDAP аутентификации позволяет авторизоваться на сервере Loginom через LDAP сервер.
en: Use of the LDAP authentication enables to log in to the Loginom server by means of the LDAP server.

source: Использование Подмоделей позволяет легко реализовать вложенность циклов.
en: Use of the Supernodes provides easy implementation of loop nesting.

source: Использование единого хранилища позволяет обеспечить непротиворечивость данных и централизованное хранение, а также автоматически обеспечивает всю необходимую поддержку процесса анализа данных.
en: Usage of the unified data warehouse provides data coherence and centralized storage. It also automatically provides all the support required for the data analysis process.

source: Использование модулей в коде узла JavaSript:
en: Use of modules in the code of the JavaSript node:

source: Использование модуля "child_module.js" в коде узла JavaSript:
en: Use of "child_module.js" module in the code of the JavaSript node:

source: Использование результатов такого преобразования для построения моделей бинарной классификации (например, логистической регрессии), позволяет повысить их точность и устойчивость к изменению входных данных.
en: Usage of such conversion results for the binary classification models training (for example, logistic regression) enables to improve their accuracy and resilience to the input data change.

source: Использование слишком больших значений глубины разложения может привести к потере полезной информации из-за слишком большой степени «огрубления» данных.
en: The usage of too high values of decomposition level can cause the loss of usefull information in connection with too high level of the data "coarsening".

source: Использование собственных форматов позволяет:
en: Usage of the branded data sources enables to achieve the following goals:

source: Использовать готовые алгоритмы обработки данных, созданные в других сценариях и пакетах через механизм Производные компоненты.
en: It can use ready algorithms of processing of the data created in other workflows and packages using the Derived Components mechanism.

source: Использовать идентификатор — флаг включает идентификаторы.
en: Use identifier: the checkbox enables identifiers.

source: Использовать кнопку Связать все автоматически, при этом происходит автоматическое связывание входных полей и параметров запроса, исходя из значений меток и типов данных полей входного набора и параметров.
en: Use Auto Link All button. It providies auto linking of the input fields and request parameters based on values of captions and types of fields data of the input data set and parameters.

source: Использовать настройки и обученные модели узлов из других сценариев и пакетов через механизм Выполнение узла.
en: It can use settings and trained models of nodes from different workflows and packages using the Node Execution mechanism.

source: Использовать параметры можно только в секции WHERE.
en: It is allowed to use parameters only in the WHERE section.

source: Использовать пространство имен Loginom Integrator;
en: Use Loginom Integrator namespace;

source: Использует для авторизации имя заданное пользователем при его регистрации в системе SOAP-сервиса.
en: The name set by a user during his registration in the SOAP service system is used for authorization.

source: Использует для авторизации пароль заданный пользователем при его регистрации в системе SOAP-сервиса.
en: The password set by a user during his registration in the SOAP service system is used for authorization.

source: Используется библиотека PCRE2.
en: PCRE2 library is used.

source: Используется для задания значений входных переменных узла, определенного параметром /Node.
en: It is used to set values of the input variables of the node defined by parameter /Node.

source: Используется для защищенной передачи пароля по незащищенному соединению.| |Учетная запись||DN пользователя с правами на чтение LDAP (поиск пользователей и групп).
en: It is used for the secure password propagation via nonsecure connection.| |Account||User DN with LDAP read rights (search for users and groups).

source: Используется для импорта данных из текстовых файлов c разделителями.
en: It is used for data import from the text files with separators.

source: Используется для импорта данных из файлов Microsoft Excel.
en: It is used for data import from the Microsoft Excel files.

source: Используется для подключения и работы с базой данных Firebird.
en: It is used for connection to the Firebird database and its operation.

source: Используется для подключения и работы с базой данных PostgreSQL.
en: It is used for connection to the PostgreSQL database and its operation.

source: Используется для подключения к Хранилищу данных Deductor Warehouse, основанному на СУБД Firebird.
en: It is used for connection to the Deductor Warehouse Data Warehouse based on Firebird DBMS.

source: Используется для подключения к Хранилищу данных Deductor Warehouse, основанному на СУБД MS SQL Server.
en: It is used for connection to the Deductor Warehouse Data Warehouse based on MS SQL Server DBMS.

source: Используется для подключения к Хранилищу данных Deductor Warehouse, основанному на СУБД Oracle.
en: It is used for connection to the Deductor Warehouse Data Warehouse based on Oracle DBMS.

source: Используется для подключения к базам данных платформы 1С:Предприятие версий 8.x.
en: It is used for connection to the 1C:Enterprise 8.x platform databases.

source: Используется для подключения к базе данных ClickHouse.
en: It is used for connection to the ClickHouse database.

source: Используется для подключения к базе данных Interbase.
en: It is used for connection to the Interbase database.

source: Используется для подключения к базе данных MS SQL.
en: It is used for connection to the MS SQL database.

source: Используется для подключения к базе данных Microsoft Access.
en: It is used for connection to the Microsoft Access database.

source: Используется для подключения к базе данных MySQL.
en: It is used for connection to the MySQL database.

source: Используется для подключения к базе данных Oracle.
en: It is used for connection to the Oracle database.

source: Используется для подключения к базе данных SQLite.
en: It is used for connection to the SQLite database.

source: Используется для подключения к одному из источников данных ODBC.
en: It is used for connection to one of the ODBC data sources.

source: Используется для подключения к файлам XSD-схем.
en: It is used for connection to the XSD schemas files.

source: Используется для подключения к файлу Microsoft Excel как к базе данных.
en: It is used for connection to the Microsoft Excel file as to a database.

source: Используется либо предустановленный в ОС Windows клиент OLE DB, либо SQL Server Native Client.
en: Either the OLE DB client preinstalled in Windows OS, or SQL Server Native Client is used.

source: Используется по умолчанию.
en: It is used by default.

source: Используется по умолчанию;
en: It is used by default.

source: Используется при отладке Сценария.
en: It is used during the Workflow debugging.

source: Используется, если не выбран флаг Автоматическая настройка или же он задан с помощью переменной.
en: It is used if Auto setup checkbox is not selected, or it is set by means of variable.

source: Используются, если включен блок настроек параметров и в нем установлен флаг Использовать детальные настройки, или же он задан с помощью переменной.
en: They are used if the parameters configuration pack is enabled, and Use detailed settings checkbox is selected in it, or it can be set by means of variable.

source: Исследования показали, что в этом случае получается наиболее достоверная оценка выходной ошибки модели.
en: Research has shown that in this case the most reliable estimate of the output model error is provided.

source: Источник - строковое выражение.
en: Source - string expression.

source: Исходная таблица:
en: Source table:

source: Исходное строковое значение, указанное в командной строке, конвертируется к типу данных целевой переменной:
en: The source string value specified in the command string is converted according to the data type of the target variable:

source: Исходные данные
en: Source data

source: Исходный набор данных:
en: Source data set:

source: Итак, при необходимости использования объектов (например узлы Сценария, Подключения, Производные компоненты) из других Пакетов необходимо применять ссылки на другие пакеты.
en: Thus, when it is required to use the objects (for example, the Workflow nodes, Connections, Derived components) from other Packages, references to other packages must be used.

source: Итого
en: Total

source: Итоговый набор в порту "Переменные" содержит перечень всех переменных, их значения вычислены с учетом вышеизложенного приоритета.
en: The final set in the "Variables" port contains a list of all variables. Their values are calculated taking into account the priority specified above.

source: Их значения никак не изменяются.
en: Their values do not change anyhow.

source: Их изменение может привести к изменению результатов выполнения Сценария.
en: Their change can cause the change of the Workflow execution results.

source: Их можно использовать для задания таких параметров, как Тайм-аут выполнения узла и Завершить программу по тайм-ауту.
en: They can be used to set such parameters as Node execution timeout and Terminate program by timeout.

source: Их особенностью является то, что они имеют структуру базового компонента, но могут иметь уникальные признаки.
en: Their peculiarity consists in the fact that they have the base component structure but can also have unique indicators.

source: К исходному набору можно присоединять переменные.
en: Variables can be added to the source data set.

source: К примеру, можно добавить отображение какого-либо символа.
en: For example, it is possible to add display of any character.

source: К самоорганизующимся сетям относятся, в частности, сети Кохонена.
en: In particular, Kohonen networks relate to self-organizing networks.

source: Каждая группа записей ассоциирована с признаком (полем) исходного набора данных, являющимся входным для узла Конечные классы.
en: Each group of records is associated with an indicator (field) of the source data set that is the input one for the Coarse Classes node.

source: Каждая запись обучающего множества представляет собой обучающий пример, содержащий заданное входное воздействие и соответствующий ему правильный выходной (целевой) результат.
en: Each record of the training set is a training example with the set input effect and correct output (target) result that corresponds to it.

source: Каждая из присоединяемых переменных добавляет новый столбец к исходному набору.
en: Each of the joined variables adds a new column to the source data set.

source: Каждая строка такой выборки содержит:
en: Each row of such sample contains the following data:

source: Каждая ячейка хранит значение и тип данных.
en: Each cell keeps the value and data type.

source: Каждое поле набора данных имеет группу параметров, таких как имя, метка, тип данных и т.д.
en: Each data set field has a group of such features as name, caption, data type, etc.

source: Каждому варианту агрегации на выходе будет соответствовать отдельная переменная.
en: Each output aggregation option will correspond to a separate variable.
